system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
// -----------------------------tensor_xf_2024------------------------------- //

FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


castellatedMesh true;
snap            true;
addLayers      false;


geometry
{
    body.stl { type triSurfaceMesh; name body;}
    inlet1.stl { type triSurfaceMesh; name inlet1;}
    inlet2.stl { type triSurfaceMesh; name inlet2;}
    outlet1.stl { type triSurfaceMesh; name outlet1;}
}


castellatedMeshControls
{
    maxLocalCells 200000;
    maxGlobalCells 10000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 6;
    features ();


    refinementSurfaces
    {
        body        { level (0 0);}
        inlet1        { level (0 0);}
        inlet2        { level (0 0);}
        outlet1        { level (0 0);}
    }

    resolveFeatureAngle 2;

    refinementRegions
    {
	refinementBox { mode inside; level 1; }
    }


    locationInMesh (-0.045 0.120 0.014);
    allowFreeStandingZoneFaces false;
}



snapControls
{
    nSmoothPatch 3;
    tolerance 4.0;
    nSolveIter 30;
    nRelaxIter 5;
}


addLayersControls
{
    relativeSizes true;
    layers
    {
        naca2412.stl
        {
            nSurfaceLayers 1;
        }
    }

    expansionRatio 1.0;

    finalLayerThickness 0.3;

    minThickness 0.1;
    nGrow 0;
    featureAngle 60;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 2;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minFlatness 0.5;
    minVol 1e-13;
    minTetQuality 1e-30;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
}

mergeTolerance 1E-6;


// ************************************************************************* //
// *********************	tensor-inf-2024		******************** //
// *********************	pttensor.com		******************** //
