0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    body
    {
        type            noSlip;
    }
    inlet1
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.001;  // Specify the mass flow rate (in kg/s)
        rho             rho;           // Reference to the density field (for compressible solvers)
        value           uniform (0 0 0);  // Placeholder, calculated by OpenFOAM
    }
    inlet2
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.001;  // Specify the mass flow rate (in kg/s)
        rho             rho;           // Reference to the density field (for compressible solvers)
        value           uniform (0 0 0);  // Placeholder, calculated by OpenFOAM
    }
    outlet1
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
// *********************	tensor-inf-2024		******************** //
// *********************	pttensor.com		******************** //
