0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{

    body
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }
    inlet1
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }
    inlet2
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 101325;
    }
    outlet1
    {
        type            fixedValue;
        value           uniform 101325;
    }
}

// ************************************************************************* //
// *********************	tensor-inf-2024		******************** //
// *********************	pttensor.com		******************** //
