0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{

    body
    {
        type            epsilonWallFunction;
        value           uniform 0.01;
    }
    inlet1
    {
        type            fixedValue;
        value           uniform 0.01;
    }
    inlet2
    {
        type            fixedValue;
        value           uniform 0.01;
    }
    outlet1
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
// *********************	tensor-inf-2024		******************** //
// *********************	pttensor.com		******************** //
